06_Videogames_Tournament/app/controllers/api/tournaments_controller.rb

SELECT "tournaments".* FROM "tournaments"
---
  def index
    tournaments = Tournament.all

INSERT INTO "tournaments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Street Fighter"], ["created_at", "2016-09-13 15:10:57.256741"], ["updated_at", "2016-09-13 15:10:57.256741"]]
---
  def create
		tournament = Tournament.create(tournament_params)